import React from "react";

export default function Public() {
  return (
    <div style={{ display: "flex", maxWidth: 800, padding: "20px 10px" }}>
      <div style={{ width: 2, height: "100%" }}></div>
      <div style={{ color: "white", fontSize: 20, textAlign: "justify" }}>
        <h2 style={{ margin: "0 0 10px" }}>1. Определения и термины</h2>
        <p>
          1.1. Сайт – любой из сайтов Forest House (ИП “Михайлов”), на котором
          размещена информация о предлагаемых им товарах, маркетинговых акциях и
          иной информации в сети Интернет.
        </p>
        <p>
          1.2. Мобильное приложение – любое мобильное приложение Forest House
          (ИП “Михайлов”), в котором размещена информация о предлагаемых им
          товарах, маркетинговых акциях и иной информации.
        </p>
        <p>
          1.3. Клиент – физическое лицо, использующее сайт или мобильное
          приложение Forest House (ИП “Михайлов”).
        </p>
        <p>
          1.4. Персональные данные - информация, относящаяся к определенному
          Клиенту, указанная в п. 3.1 настоящего Положения.
        </p>
        <p>
          1.5. Обработка персональных данных – любые операции, совершаемые с
          использованием средств автоматизации или без использования таких
          средств с персональными данными, включая сбор, запись, систематизацию,
          накопление, хранение, уточнение (обновление, изменение), извлечение,
          использование, передачу (распространение, предоставление, доступ),
          обезличивание, блокирование, удаление, уничтожение персональных
          данных.
        </p>
        <h2>
          2. Цели и принципы политики конфиденциальности и сбора персональных
          данных
        </h2>
        <p>
          2.1. Политика конфиденциальности действует в отношении любой указанной
          в разделе 3 информации, которую Forest House (ИП “Михайлов”) может
          получить о Клиенте во время использования сайта, мобильного
          приложения.
        </p>
        <p>2.2. Клиент предоставляет свои персональные данные с целью:</p>
        <p>- оформления заказов </p> <p> - уведомления о состоянии заказов</p>
        <p> - получения верификационных кодов заказов</p>
        <p>- верификации заказов с помощью верификационных кодов </p>
        <p>
          - получения новостей, информации о продуктах, мероприятиях, рекламных
          акциях или услугах
        </p>
        <p>
          Предоставленные данные могут быть использованы в целях продвижения
          товаров от имени Forest House (ИП “Михайлов”) или от имени партнеров
          Forest House (ИП “Михайлов”).
        </p>
        <p>
          2.3. Обеспечение надежности хранения информации и прозрачности целей
          сбора персональных данных. Персональные данные Клиентов собираются,
          хранятся, обрабатываются, используются, передаются и удаляются
          (уничтожаются) в соответствии с законодательством РФ, в т.ч.
          Федеральным законом 27.07.2006 № 152-ФЗ «О персональных данных», и
          настоящей Политикой конфиденциальности.
        </p>
        <h2> 3. Информация, подлежащая обработке </h2>
        <h3>
          3.1. Персональные данные, разрешённые к обработке в рамках настоящей
          Политики конфиденциальности, предоставляются Клиентом путём заполнения
          формы на сайте Forest House (ИП “Михайлов”) или в мобильном приложении
          Forest House (ИП “Михайлов”) и включают в себя следующую информацию:
        </h3>
        <p>3.1.1. Имя Клиента;</p>
        <p> 3.1.2. Контактный телефон Клиента;</p>
        <p> 3.1.3. Историю заказов.</p>
        <h3>
          3.2. Компания также получает данные, которые автоматически передаются
          в процессе просмотра при посещении сайта или мобильного приложения, в
          т. ч.:
        </h3>
        <p>3.2.1. IP адрес;</p>
        <p>
          3.2.2. Информация о браузере или мобильном приложении (или иной
          программе, которая осуществляет доступ к сервису);
        </p>
        <p> 3.2.3. Время доступа.</p>
        <h2> 4. Обработка и использование персональных данных </h2>
        <p>
          4.1. Обработка персональных данных Клиента осуществляется без
          ограничения срока, любым законным способом, в том числе в
          информационных системах персональных данных с использованием средств
          автоматизации или без использования таких средств.
        </p>
        <p>
          4.2. Соглашаясь с настоящей Политикой конфиденциальности Клиент
          предоставляет Forest House (ИП “Михайлов”) свое согласие на обработку
          указанных в разделе 3 персональных данных всеми указанными в настоящей
          Политике способами.
        </p>
        <p>
          4.3. Forest House (ИП “Михайлов”) не вправе передавать информацию о
          Клиенте неаффилированным лицам или лицам, не связанным с Forest House
          (ИП “Михайлов”) договорными отношениями.
        </p>
        <p>
          4.4. Передача информации аффилированным лицам и лицам, которые связаны
          с Forest House (ИП “Михайлов”) договорными отношениями, осуществляется
          для исполнения заказа Клиента, а также для возможности информирования
          Клиента о проводимых акциях, предоставляемых услугах, проводимых
          мероприятиях.
        </p>
        <p>
          4.5. Аффилированные лица и лица, связанные с Forest House (ИП
          “Михайлов”) договорными отношениями, принимают на себя обязательства
          обеспечивать конфиденциальность информации и гарантировать ее защиту,
          а также обязуются использовать полученную информацию исключительно для
          целей исполнения указанных действий или оказания услуг.
        </p>
        <p>
          4.6. Forest House (ИП “Михайлов”) принимает все необходимые меры для
          защиты персональных данных Клиента от неавторизованного доступа,
          изменения, раскрытия или уничтожения.
        </p>
        <h2>5. Права и обязанности Клиента </h2>
        <p>
          5.1. Клиент обязуется не сообщать каким-либо третьим лицам номер
          заказа и/или верификационный код, используемые им для идентификации на
          сайте или в мобильном приложении Forest House (ИП “Михайлов”).
        </p>
        <p>
          5.2. Клиент обязуется соблюдать должную осмотрительность при хранении
          пароля, а также при его вводе.
        </p>
        <p>
          5.3. Клиент вправе изменять свои личные данные, а также требовать
          удаление личных данных у Компании.
        </p>
        <h2>6. Дополнительные условия</h2>
        <p>
          6.1. Соглашаясь с настоящей Политикой конфиденциальности, Клиент
          предоставляет свое согласие на получение информации о заказах и прочих
          уведомлений технического характера, а также уведомлений рекламного
          характера, в том числе о текущих маркетинговых акциях и актуальных
          предложениях Forest House (ИП “Михайлов”) с помощью SMS, но не
          ограничиваясь им. Клиент может в любое время отказаться от получения
          такой информации путём обращения в службу поддержки.
        </p>
        <p>
          6.2. Срок действия согласия определяется достижением целей обработки.
        </p>
        <p>
          6.3. Forest House (ИП “Михайлов”) несет ответственность перед клиентом
          в случаях, предусмотренных действующим законодательством.
        </p>
        <p>
          6.4. Forest House (ИП “Михайлов”) освобождается от ответственности в
          случаях, когда информация о Клиенте: - стала публичным достоянием до
          её утраты или разглашения; - была получена от третьей стороны до
          момента её получения Forest House (ИП “Михайлов”); - была разглашена с
          согласия Клиента.
        </p>
        <p>
          6.5. Forest House (ИП “Михайлов”) вправе вносить изменения в политику
          конфиденциальности в одностороннем порядке. Изменения вступают в силу
          с момента их опубликования на сайте или в мобильном приложении ИП
          “Михайлов”.
        </p>
      </div>
    </div>
  );
}
